## Ezinne Okechukwu <br/> Data Analyst Internship SQL Assessment <br/> God is Good Logistics <br/> August 22nd, 2024

## PRE-TASK: Creating Table and Inserting Values

#### Load SQL Extension and Connect to PostgreSQL Database

In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:1234@localhost:5432/gigl_da_intern

#### create, insert values into customer table and view table

In [3]:
%%sql
DROP TABLE IF EXISTS customers;

CREATE TABLE customers(
    customer_id VARCHAR PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100),
    date_joined DATE);

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
Done.
Done.

[]

In [4]:
%%sql
INSERT INTO customers 
    (customer_id, name, email, date_joined)
    VALUES
    ('CUST1001', 'John Smith', 'john.smith@gmail.com', '2023-02-15'),
    ('CUST1002', 'Emily Johnson', 'emily.johnson@gmail.com', '2022-11-03'),
    ('CUST1003', 'Michael Brown', 'michael.brown@gmail.com', '2023-05-25')

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[]

In [5]:
%%sql
SELECT *
FROM customers

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('CUST1001', 'John Smith', 'john.smith@gmail.com', datetime.date(2023, 2, 15)),
 ('CUST1002', 'Emily Johnson', 'emily.johnson@gmail.com', datetime.date(2022, 11, 3)),
 ('CUST1003', 'Michael Brown', 'michael.brown@gmail.com', datetime.date(2023, 5, 25))]

#### create, insert values into orders table and view table

In [6]:
%%sql
DROP TABLE IF EXISTS orders;

CREATE TABLE orders(
    order_id VARCHAR(20) PRIMARY KEY,
    customer_id VARCHAR(20),
    order_date DATE,
    total_amount NUMERIC,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
Done.
Done.

[]

In [7]:
%%sql
-- insert values into orders table

INSERT INTO orders
    (order_id, customer_id, order_date, total_amount)
VALUES
    ('ORD1',	'CUST1001',	'2023-07-10',	950),
    ('ORD2',	'CUST1002',	'2023-06-15',	75),
    ('ORD3',	'CUST1003',	'2023-08-05',	150)

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[]

In [8]:
%%sql
-- view orders table
SELECT *
FROM orders;

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('ORD1', 'CUST1001', datetime.date(2023, 7, 10), Decimal('950')),
 ('ORD2', 'CUST1002', datetime.date(2023, 6, 15), Decimal('75')),
 ('ORD3', 'CUST1003', datetime.date(2023, 8, 5), Decimal('150'))]

#### create, insert values into product table and view table

In [9]:
%%sql
-- create table products

DROP TABLE IF EXISTS products;
CREATE TABLE products(
    product_id VARCHAR(20) PRIMARY KEY,
    product_name VARCHAR(100),
    category VARCHAR(100),
    price INT)

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
Done.
Done.

[]

In [10]:
%%sql
-- insert values into products table
INSERT INTO products
    (product_id, product_name, category, price)

VALUES
    ('PROD1',	'Laptop',	'Electronics',	800),
    ('PROD2',	'Headphones',	'Electronics',	150),
    ('PROD3',	'Coffee Maker',	'Home Appliances',	75)

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[]

In [11]:
%%sql
-- view products table
SELECT *
FROM products

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('PROD1', 'Laptop', 'Electronics', 800),
 ('PROD2', 'Headphones', 'Electronics', 150),
 ('PROD3', 'Coffee Maker', 'Home Appliances', 75)]

#### create, insert values into order_details table and view table

In [12]:
%%sql
-- create order_details table

DROP TABLE IF EXISTS order_details;
CREATE TABLE order_details(
    order_id VARCHAR(20),
    product_id VARCHAR(20),
    quantity INT,
    subtotal NUMERIC,
    FOREIGN KEY(order_id) REFERENCES orders(order_id),
    FOREIGN KEY(product_id) REFERENCES products(product_id)
)

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
Done.
Done.

[]

In [13]:
%%sql
-- insert values into order_details

INSERT INTO order_details
VALUES
    ('ORD1',	'PROD1',	1,	800),
    ('ORD1',	'PROD2',	1,	150),
    ('ORD2',	'PROD3',	1,	75),
    ('ORD3',	'PROD2',	1,	150)

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
4 rows affected.

[]

In [14]:
%%sql
-- view order_details table

SELECT * FROM order_details;

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
4 rows affected.

[('ORD1', 'PROD1', 1, Decimal('800')),
 ('ORD1', 'PROD2', 1, Decimal('150')),
 ('ORD2', 'PROD3', 1, Decimal('75')),
 ('ORD3', 'PROD2', 1, Decimal('150'))]

## TASK

#### 1: Retrieve a list of all customers who made a purchase in the last 6 months.

In [15]:
%%sql
SELECT DISTINCT(c.customer_id), 
    c.name AS customer_name
FROM customers c
INNER JOIN orders o
USING(customer_id)
WHERE o.order_date >= NOW() - INTERVAL '6 months';

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
0 rows affected.

[]

#### 2: Calculate the average order value for each customer

In [16]:
%%sql
SELECT c.customer_id, c.name,
    ROUND(AVG(o.total_amount),2) AS avg_spending
FROM customers c
JOIN orders o
USING (customer_id)
GROUP BY c.customer_id, c.name;

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('CUST1001', 'John Smith', Decimal('950.00')),
 ('CUST1002', 'Emily Johnson', Decimal('75.00')),
 ('CUST1003', 'Michael Brown', Decimal('150.00'))]

#### 3: Find the total revenue generated each month

In [17]:
%%sql
SELECT TO_CHAR(order_date, 'Mon') AS month,
    EXTRACT (YEAR FROM order_date) AS year,
    SUM(total_amount) AS total_amount
FROM orders
GROUP BY year, month

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('Aug', Decimal('2023'), Decimal('150')),
 ('Jul', Decimal('2023'), Decimal('950')),
 ('Jun', Decimal('2023'), Decimal('75'))]

#### 4: Show the top 5 products by sales volume.

In [18]:
%%sql
SELECT p.product_id, 
    p.product_name AS product_name, 
    COUNT(od.product_id) AS sales_volume
FROM products p
INNER JOIN order_details od
USING(product_id)
GROUP BY p.product_id, p.product_name
ORDER BY COUNT(od.product_id) DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('PROD2', 'Headphones', 2),
 ('PROD1', 'Laptop', 1),
 ('PROD3', 'Coffee Maker', 1)]

#### 5: Determine the revenue generated from each product category.

In [19]:
%%sql
SELECT p.category AS product_category, 
    SUM(od.subtotal) AS total
FROM products p
INNER JOIN order_details od
USING(product_id)
GROUP BY p.category

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
2 rows affected.

[('Home Appliances', Decimal('75')), ('Electronics', Decimal('1100'))]

#### 6: Identify customers who placed orders but haven’t made any purchases in the last 3 months.

In [20]:
%%sql
SELECT customer_id, 
    name AS customer_name
FROM customers c
JOIN orders o
USING(customer_id)
WHERE NOT EXISTS (
    SELECT order_id
    FROM orders o2
    WHERE o2.customer_id = c.customer_id
    AND o2.order_date >= CURRENT_DATE - INTERVAL '3 months'
    );

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
3 rows affected.

[('CUST1001', 'John Smith'),
 ('CUST1002', 'Emily Johnson'),
 ('CUST1003', 'Michael Brown')]

#### 7: Identify quarterly sales growth trends over the past year

In [21]:
%%sql
SELECT 
    EXTRACT(QUARTER FROM order_date) AS quarter, 
    EXTRACT(YEAR FROM order_date) AS year,
    SUM(total_amount)
FROM orders
WHERE order_date >= CURRENT_DATE - INTERVAL '1 year'
GROUP BY year, quarter
ORDER BY year, quarter DESC;

 * postgresql://postgres:***@localhost:5432/gigl_da_intern
0 rows affected.

[]